<a href="https://colab.research.google.com/github/kaivanshah14/AmazonDatabasePrototype/blob/main/AMAZON_DB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **DBMS MINIPROJECT : AMAZON DATABASE**

KAIVAN - 40

SHREY - 41

URVANSH - 42

HAFSA - 43

**AMAZON DB** - A database on Amazon gives us information about various products available, their prices, details about customers as well as the suppliers. Since Amazon handles a lot of data a database in necessary in such a case.

We have created tables and stored the data in two external files - 'amazondb.txt' and 'amazondbdata.txt' using MySQL and have imported them to perform various SQL Operations

*Code starts from here*

In [ ]:
import sqlite3
import pandas as pd

In [ ]:
conn_amazon = sqlite3.connect('amazon.db')
cursor = conn_amazon.cursor()

sql_file = open('amazondb.sql')
sql_amazondb = sql_file.read()
cursor.executescript(sql_amazondb)

sql_file = open('amazondbdata.sql')
sql_amazondbdata = sql_file.read()
cursor.executescript(sql_amazondbdata)

Q1. Display all the orders placed by Customer with Customer ID 'C004'

In [ ]:
q1 = '''
SELECT *
FROM ORDERS
WHERE CID = 'C004'
ORDER BY O_DATE
'''
table = pd.read_sql_query(q1, conn_amazon)
table

       O_DATE   OID   CID      D_DATE  PAYID
0  2020-04-16   OR1  C004  2020-04-19   PMT1
1  2020-09-07  OR10  C004  2020-09-16  PMT10

Q2. Display all the product from the brand ZARA

In [ ]:
q2 = '''
 SELECT *
FROM PRODUCT
WHERE BRAND = 'ZARA'
'''
table = pd.read_sql_query(q2, conn_amazon)
table

    PID P_NAME  COST AVAILABILITY DISCOUNT BRAND
0  P001  SHIRT  2000         TRUE      10%  ZARA
1  P009  SHIRT  2000         TRUE      10%  ZARA

Q3. Diplay all the customers who have opted for Cash on Delivery with Amount greater than 3000 Rs

In [ ]:
q3 = '''
SELECT C_NAME, OID, PID, P_NAME, COST, 
QUANTITY, COST*QUANTITY AS AMOUNT, PAYID, PAY_TYPE
FROM PRODUCT 
NATURAL INNER JOIN CART 
NATURAL INNER JOIN ORDERS 
NATURAL INNER JOIN CUSTOMER 
NATURAL INNER JOIN PAYMENT
WHERE AMOUNT>3000 
AND PAY_TYPE = 'COD'
'''
table = pd.read_sql_query(q3, conn_amazon)
table

        C_NAME  OID   PID P_NAME  COST  QUANTITY  AMOUNT PAYID PAY_TYPE
0  MANISH SHAH  OR6  P007  KURTA  5200         4   20800  PMT6      COD

Q4. Display all the available products which have price less than 650 after applying the discount

In [ ]:
q4 = '''
SELECT *
FROM PRODUCT
WHERE (COST - COST*(DISCOUNT/100)) < 650
AND AVAILABILITY = 'TRUE'
'''
table = pd.read_sql_query(q4, conn_amazon)
table

    PID   P_NAME  COST AVAILABILITY DISCOUNT       BRAND
0  P002     PANT   600         TRUE      20%       MANGO
1  P004  T-SHIRT   600         TRUE      20%       GUCCI
2  P010    SHIRT   700         TRUE      10%  PANTALOONS

Q5. Display all the orders and their corresponding payments made based on payment ID

In [ ]:
q5 = '''
SELECT *
FROM ORDERS INNER JOIN PAYMENT 
ON ORDERS.PAYID = PAYMENT.PAYID
'''
table = pd.read_sql_query(q5, conn_amazon)
table

       O_DATE   OID   CID      D_DATE  PAYID  PAYID   PAY_TYPE    PAY_DATE
0  2020-04-16   OR1  C004  2020-04-19   PMT1   PMT1  GOOGLEPAY  2020-04-16
1  2018-01-31   OR2  C006  2018-02-04   PMT2   PMT2   PHONEPAY  2018-01-31
2  2018-03-02   OR3  C007  2018-03-06   PMT3   PMT3        COD  2018-03-06
3  2016-02-28   OR4  C001  2016-03-03   PMT4   PMT4        COD  2016-03-03
4  2015-06-15   OR5  C003  2015-06-20   PMT5   PMT5        UPI  2015-06-15
5  2015-06-15   OR6  C003  2015-06-20   PMT6   PMT6        COD  2015-06-20
6  2020-05-21   OR7  C005  2020-05-27   PMT7   PMT7      PAYTM  2020-05-21
7  2021-05-14   OR8  C008  2021-05-19   PMT8   PMT8  GOOGLEPAY  2021-05-14
8  2020-11-25   OR9  C010  2020-11-30   PMT9   PMT9        UPI  2020-11-25
9  2020-09-07  OR10  C004  2020-09-16  PMT10  PMT10        COD  2020-09-16

Q6. Display all the employees who are currently handling no customers

In [ ]:
q6 = '''
SELECT ENAME AS 'EMPLOYEE NAME'
FROM STAFF AS S
WHERE S.EID NOT IN (SELECT EID FROM CUSTOMERCARE)
'''
table = pd.read_sql_query(q6, conn_amazon)
table

      EMPLOYEE NAME
0  Mr Denver Enrica
1   Mr Perry Shawer

Q7. Display all the customers who have placed an order between 2019 - 2020 and have made payment through Google Pay

In [ ]:
q7 = '''
SELECT C_NAME, O_DATE, PAY_TYPE
FROM ORDERS NATURAL INNER JOIN CUSTOMER 
NATURAL INNER JOIN PAYMENT
WHERE O_DATE BETWEEN '2019-01-01' AND '2020-12-31'
AND PAY_TYPE = 'GOOGLEPAY'
'''
table = pd.read_sql_query(q7, conn_amazon)
table

       C_NAME      O_DATE   PAY_TYPE
0  ARUN YADAV  2020-04-16  GOOGLEPAY

Q8. Display all the customers who have ordered a shirt and have opted for cash on delivery

In [ ]:
q8 = '''
SELECT DISTINCT C_NAME, P_NAME, 
PAY_TYPE, OID, PAYID
FROM ORDERS 
NATURAL INNER JOIN CUSTOMER 
NATURAL INNER JOIN PAYMENT 
NATURAL INNER JOIN PRODUCT 
NATURAL INNER JOIN CART
WHERE P_NAME = 'SHIRT' AND
PAY_TYPE = 'COD'
'''
table = pd.read_sql_query(q8, conn_amazon)
table

          C_NAME P_NAME PAY_TYPE   OID  PAYID
0  GUNJAN PARMAR  SHIRT      COD   OR3   PMT3
1     ARUN YADAV  SHIRT      COD  OR10  PMT10

Q9. Display all the products which are available and have a price between 500 - 3000

In [ ]:
q9 = '''
SELECT *
FROM PRODUCT
WHERE AVAILABILITY = 'TRUE' AND
COST BETWEEN 500 AND 3000
'''
table = pd.read_sql_query(q9, conn_amazon)
table

    PID   P_NAME  COST AVAILABILITY DISCOUNT       BRAND
0  P001    SHIRT  2000         TRUE      10%        ZARA
1  P002     PANT   600         TRUE      20%       MANGO
2  P004  T-SHIRT   600         TRUE      20%       GUCCI
3  P006  JOGGERS  2300         TRUE       0%         HRX
4  P009    SHIRT  2000         TRUE      10%        ZARA
5  P010    SHIRT   700         TRUE      10%  PANTALOONS

Q10. Display all the supplier who supply shirt

In [ ]:
q10 = '''
SELECT S.SINFO, P.P_NAME
FROM SUPPLIER AS S, SUPPLIES AS T, PRODUCT AS P 
WHERE S.SID = T.SID AND
T.PID = P.PID AND
P_NAME = 'SHIRT'
'''
table = pd.read_sql_query(q10, conn_amazon)
table

             SINFO P_NAME
0      SHAH SHIRTS  SHIRT
1  SHAIKH PRODUCTS  SHIRT
2           ZARAPR  SHIRT
3       PANTSELLER  SHIRT

In [ ]:
q11 = '''
select *
from customer
'''
table = pd.read_sql_query(q11, conn_amazon)
table

    CID           C_NAME  ...        C_PH                     C_EMAIL
0  C001     GAJANAN RANE  ...  9029847543        gajarane22@gmail.com
1  C002  KISHANLAL MEHTA  ...  8652558944        krishcom13@gmail.com
2  C003      MANISH SHAH  ...  8569321478      manishshah37@gmail.com
3  C004       ARUN YADAV  ...  8547693210       arunyadav55@gmail.com
4  C005      HIRAL SHETH  ...  7856493939         hiral9988@gmail.com
5  C006       YASH DOSHI  ...  7412589630        yashdoshi4@gmail.com
6  C007    GUNJAN PARMAR  ...  8523691470  gunjan1255parmar@gmail.com
7  C008      KAVITA MORE  ...  9632014578      kavitamore86@gmail.com
8  C009     LALAN MISHRA  ...  9658741023       lalanmishra@gmail.com
9  C010     GEETA SHELAR  ...  9651230477     geetashelar63@gmail.com

[10 rows x 5 columns]

In [ ]:
q12 = '''
select *
from product
'''
table = pd.read_sql_query(q12, conn_amazon)
table

    PID   P_NAME  COST AVAILABILITY DISCOUNT       BRAND
0  P001    SHIRT  2000         TRUE      10%        ZARA
1  P002     PANT   600         TRUE      20%       MANGO
2  P003     PANT   850        FALSE      15%  PANTALOONS
3  P004  T-SHIRT   600         TRUE      20%       GUCCI
4  P005     BELT   400        FALSE      20%        DIOR
5  P006  JOGGERS  2300         TRUE       0%         HRX
6  P007    KURTA  5200         TRUE      30%       LIBAS
7  P008      CAP  1200        FALSE      10%    ROADSTER
8  P009    SHIRT  2000         TRUE      10%        ZARA
9  P010    SHIRT   700         TRUE      10%  PANTALOONS

In [ ]:
q13 = '''
select *
from supplier
'''
table = pd.read_sql_query(q13, conn_amazon)
table

    SID             SINFO                S_ADD
0  S001       SHAH SHIRTS   BORIVALI(E) MUMBAI
1  S002   SHAIKH PRODUCTS        CHENNAI INDIA
2  S003            ZARAPR       CALIFORNIA USA
3  S004        MANGOPRODS          TOKYO JAPAN
4  S005        ROADSTERCO  MIRA ROAD(E) MUMBAI
5  S006      LIBAS KURTAS      KARNATAKA INDIA
6  S007          SHIRTSCO         PARIS FRANCE
7  S008        PANTSELLER     JAIPUR RAJASTHAN
8  S009        TULIP SSTR          ASSAM INDIA
9  S010  MINISO SUPPLIERS      MALAD(E) MUMBAI

In [ ]:
q14 = '''
select *
from staff
'''
table = pd.read_sql_query(q14, conn_amazon)
table

    EID                ENAME                      EADD       EPH
0  E001   Ms Calderdale Emma         3364  Dane Street  324-9134
1  E002  Ms Ricardo Marshall  3757  Martha Ellen Drive  324-4472
2  E003       Mr Arshad Arif          73  Bastin Drive  324-4575
3  E004       Ms RobertsAnne         308  Alfred Drive  898-3456
4  E005     Mr Denver Enrica         310  Alfred Drive  504-4434
5  E006   Ms Namowa Mirrelle    2996  Mount Olive Road  890-3243
6  E007      Mrs Smith Gemma     2548  Randolph Street  354-7845
7  E008       Mr Edmund Pena         4199  Tuna Street  324-7846
8  E009      Mr Perry Shawer            238  Ryan Road  334-7890
9  E010      Mrs Rita Altson      4468  Platinum Drive  314-7565